package com.wmy.kotlin.mvp.lib.utils

import android.content.Context
import android.util.Base64
import com.google.gson.Gson
import com.google.gson.reflect.TypeToken
import com.wmy.kotlin.demo.utils.LogUtils
import com.wmy.kotlin.mvp.lib.model.Storke
import net.sourceforge.pinyin4j.PinyinHelper
import net.sourceforge.pinyin4j.format.HanyuPinyinCaseType
import net.sourceforge.pinyin4j.format.HanyuPinyinOutputFormat
import net.sourceforge.pinyin4j.format.HanyuPinyinToneType
import net.sourceforge.pinyin4j.format.HanyuPinyinVCharType
import net.sourceforge.pinyin4j.format.exception.BadHanyuPinyinOutputFormatCombination
import java.io.BufferedReader
import java.io.IOException
import java.io.InputStreamReader


/**
 * 自动加密解密
 *@author：wmyasw
 */
fun String.autoDecodeOrEncode() = if (isCipherText()) decodeHexagram() else encodeHexagram()


fun String?.isCipherText(): Boolean {
    this ?: return false
    var decodeHitCount = 0
    var temp: String
    var start = 0
    for (end in 0..length) {
        temp = substring(start, end)
        if (DECODE_MAP_TABLE.containsKey(temp)) {
            start = end
            decodeHitCount++
        }
    }
    return if (start != length) {
        val symbol = convertToSymbol()
        if (symbol.isNotEmpty()) symbol.isCipherText() else false
    } else true
}

/**
 * 将字符串中的中文转化为拼音,其他字符不变
 *
 * @param inputString
 * @return
 */
fun String.toPinYin(): String {
    val format = HanyuPinyinOutputFormat()
    format.caseType = HanyuPinyinCaseType.LOWERCASE
    format.toneType = HanyuPinyinToneType.WITH_TONE_MARK
    format.vCharType = HanyuPinyinVCharType.WITH_U_UNICODE
    val input = this.toCharArray()
    var output = ""
    try {
        for (i in input.indices) {
            output += if (input[i].toString().matches(Regex("[\\u4E00-\\u9FA5]+"))) {
                val temp = PinyinHelper.toHanyuPinyinStringArray(input[i], format)
                temp[0]
            } else Character.toString(input[i])
        }
    } catch (e: BadHanyuPinyinOutputFormatCombination) {
        e.printStackTrace()
    }
    return output
}

/**
 * 使用64挂加密
 */
fun String.encodeHexagram(): String {
    val base64 = Base64.encodeToString(
            toByteArray(),
            Base64.URL_SAFE and Base64.NO_WRAP and Base64.NO_PADDING
    )
    val result = StringBuilder()
    var temp: String
    for (char in base64) {
        temp = char.toString()
        if (ENCODE_MAP_TABLE.containsKey(temp)) {
            result.append(ENCODE_MAP_TABLE[temp])
        }
    }
    return result.toString()
}

/**
 * 使用64挂解密
 */
fun String.decodeHexagram(): String {
    val base64 = StringBuilder()
    var start = 0
    var temp: String
    for (end in 0..length) {
        temp = substring(start, end)
        if (DECODE_MAP_TABLE.containsKey(temp)) {
            start = end
            base64.append(DECODE_MAP_TABLE[temp])
        }
    }
    return try {
        String(
                Base64.decode(
                        base64.toString(),
                        Base64.URL_SAFE and Base64.NO_WRAP and Base64.NO_PADDING
                )
        )
    } catch (t: Throwable) {
        base64.toString()
    }
}

fun String.convertToSymbol(): String {
    val result = StringBuilder()
    var start = 0
    var temp: String
    for (end in 0..length) {
        temp = substring(start, end)
        if (TEXT_MAP_TABLE.containsKey(temp)) {
            start = end
            result.append(TEXT_MAP_TABLE[temp])
        }
    }
    return result.toString()
}

fun String.convertToText(): String {
    val result = StringBuilder()
    var temp: String
    for (char in this) {
        temp = char.toString()
        if (SYMBOL_MAP_TABLE.containsKey(temp)) {
            result.append(SYMBOL_MAP_TABLE[temp])
        }
    }
    return result.toString()
}

fun String.convertToJieQian(): String {
    val result = StringBuilder()
    var temp: String
    for (char in this) {
        temp = char.toString()
        LogUtils.e("convertToJieQian 1 $temp}")
        if (SYMBOL_MAP_TABLE.containsKey(temp)) {
            LogUtils.e("convertToJieQian 1 ${SYMBOL_MAP_TABLE[temp]}")
            if (DECODE_MAP_JIE_TABLE.containsKey(SYMBOL_MAP_TABLE[temp])) {
                LogUtils.e("convertToJieQian 2 ${DECODE_MAP_JIE_TABLE[SYMBOL_MAP_TABLE[temp]]}")
                result.append(DECODE_MAP_JIE_TABLE[SYMBOL_MAP_TABLE[temp]])
                return result.toString()
            }
        }


    }
    return result.toString()
}

/**
 * 获取中文笔画
 */
fun String.getChineseStrokes(): String {
    val result = StringBuilder()
    var temp: String
//    if (HZ_BH_TABLE.containsValue(value = this)) {
//        LogUtils.e("convertToJieQian 1 ${char.key} :${char.value}")
    for (char in HZ_BH_TABLE) {

        if (char.value in this) {
            LogUtils.e("convertToJieQian 1 ${char.key} :${char.value}")
            return char.key
        }
//        }
    }

    return result.toString()
}

private val SYMBOL_BG_Z_MAP_TABLE = hashMapOf(
        "乾" to "天",
        "坤" to "地",
        "震" to "雷",
        "巽" to "风",
        "坎" to "水",
        "艮" to "山",
        "離" to "火",
        "兌" to "泽"
)
//后天八卦排序
private val SYMBOL_BG_MAP_TABLE = hashMapOf(
        "6" to "乾",
        "2" to "坤",
        "3" to "震",
        "4" to "巽",
        "1" to "坎",
        "8" to "艮",
        "9" to "離",
        "7" to "兌",
        "5" to "中宫"

)

private val SYMBOL_MAP_TABLE = hashMapOf(
        "䷀" to "乾",
        "䷁" to "坤",
        "䷂" to "屯",
        "䷃" to "蒙",
        "䷄" to "需",
        "䷅" to "訟",
        "䷆" to "師",
        "䷇" to "比",
        "䷈" to "小畜",
        "䷉" to "履",
        "䷊" to "泰",
        "䷋" to "否",
        "䷌" to "同人",
        "䷍" to "大有",
        "䷎" to "謙",
        "䷏" to "豫",
        "䷐" to "隨",
        "䷑" to "蠱",
        "䷒" to "臨",
        "䷓" to "觀",
        "䷔" to "噬嗑",
        "䷕" to "贲",
        "䷖" to "剝",
        "䷗" to "複",
        "䷘" to "無妄",
        "䷙" to "大畜",
        "䷚" to "頤",
        "䷛" to "大過",
        "䷜" to "坎",
        "䷝" to "離",
        "䷞" to "鹹",
        "䷟" to "恒",
        "䷠" to "遁",
        "䷡" to "大壯",
        "䷢" to "晉",
        "䷣" to "明夷",
        "䷤" to "家人",
        "䷥" to "睽",
        "䷦" to "蹇",
        "䷧" to "解",
        "䷨" to "損",
        "䷩" to "益",
        "䷪" to "夬",
        "䷫" to "姤",
        "䷬" to "萃",
        "䷭" to "升",
        "䷮" to "困",
        "䷯" to "井",
        "䷰" to "革",
        "䷱" to "鼎",
        "䷲" to "震",
        "䷳" to "艮",
        "䷴" to "漸",
        "䷵" to "歸妹",
        "䷶" to "豐",
        "䷷" to "旅",
        "䷸" to "巽",
        "䷹" to "兌",
        "䷺" to "渙",
        "䷻" to "節",
        "䷼" to "中孚",
        "䷽" to "小過",
        "䷾" to "既濟",
        "䷿" to "未濟"
)

private val DECODE_MAP_JIE_TABLE = hashMapOf(
        "乾" to "第1卦\n   乾为天（乾卦）自强不息\n  乾卦卦图\n  乾卦卦图\n  上上卦\n  象曰：困龙得水好运交，不由喜气上眉梢，一切谋望皆如意，向后时运渐渐高。这个卦是同卦（下乾上乾）相叠。象征天，喻龙（德才的君子），又象征纯粹的阳和健，表明兴盛强健。乾卦是根据万物变通的道理，以“元、亨、利、贞”为卦辞，示吉祥如意，教导人遵守天道的德行。",
        "坤" to "第2卦\n  坤为地（坤卦）厚德载物\n  上上卦\n  象曰：肥羊失群入山岗，饿虎逢之把口张，适口充肠心欢喜，卦若占之大吉昌。这个卦是同卦（下坤上坤）相叠，阴性。象征地（与乾卦相反），顺从天。承载万物，伸展无穷无尽。坤卦以雌马为象征，表明地道生育抚养万物，而又依天顺时，性情温顺。它以“先迷后得”证明“坤”顺从“乾”，依随“乾”，才能把握正确方向，遵循正道，获取吉利。",
        "屯" to "第3卦\n  水雷屯（屯卦）起始维艰\n  下下卦\n  象曰：风刮乱丝不见头，颠三倒四犯忧愁，慢从款来左顺遂，急促反惹不自由。这个卦是异卦（下震上坎）相叠，震为雷，喻动；坎为雨，喻险。雷雨交加，险象丛生，环境恶劣。“屯”原指植物萌生大地。万物始生，充满艰难险阻，然而顺时应运，必欣欣向荣。",
        "蒙" to "第4卦\n  山水蒙（蒙卦）启蒙奋发\n  中下卦\n  象曰：卦中爻象犯小耗，君子占之运不高，婚姻合伙有琐碎，做事必然受苦劳。这个卦是异卦（下坎上艮）相叠，艮是山的形象，喻止；坎是水的形象，喻险。卦形为山下有险，仍不停止前进，是为蒙昧，故称蒙卦。但因把握时机，行动切合时宜，因此，具有启蒙和通达的卦象。",
        "需" to "第5卦\n  水天需（需卦）守正待机\n  中上卦\n  象曰：明珠土埋日久深，无光无亮到如今，忽然大风吹土去，自然显露有重新。这个卦是异卦（下乾上坎）相叠，下卦是乾，刚健之意；上卦是坎，险陷之意。以刚逢险，宜稳健之妥，不可冒失行动，观时待变，所往一定成功。",
        "訟" to "第6卦\n  天水讼（讼卦）慎争戒讼\n  中下卦\n  象曰：心中有事事难做，恰是二人争路走，雨下俱是要占先，谁肯让谁走一步。这个卦是异卦（下坎上乾）相叠。同需卦相反，互为“综卦”。乾为刚健，坎为险陷。刚与险，健与险，彼此反对，定生争讼。争讼非善事，务必慎重戒惧。",
        "師" to "第7卦\n  地水师（师卦）行险而顺\n  中上卦\n  象曰：将帅领旨去出征，骑着烈马拉硬弓，百步穿杨去得准，箭中金钱喜气生。这个卦是异卦（下坎上坤）相叠。“师”指军队。坎为水、为险；坤为地、为顺，喻寓兵于农。兵凶战危，用兵乃圣人不得已而为之，但它可以顺利无阻碍地解决矛盾，因为顺乎形势，师出有名，故能化凶为吉。",
        "比" to "第8卦\n  水地比（比卦）诚信团结\n  上上卦\n  象曰：顺风行船撒起帆，上天又助一蓬风，不用费力逍遥去，任意而行大亨通。这个卦是异卦（下坤上坎）相叠，坤为地；坎为水。水附大地，地纳河海，相互依赖，亲密无间。此卦与师卦完全相反，互为综卦。它阐述的是相亲相辅，宽宏无私，精诚团结的道理。",
        "小畜" to "第9卦\n  风天小畜（小畜卦）蓄养待进\n  下下卦\n  象曰：苗逢旱天尽焦梢，水想云浓雨不浇，农人仰面长吁气，是从款来莫心高。这个卦是异卦（下乾上巽）相叠，乾为天；巽为风。喻风调雨顺，谷物滋长，故卦名小畜（蓄）。力量有限，须待发展到一定程度，才可大有作为。",
        "履" to "第10卦\n  天泽履（履卦）脚踏实地\n  中上卦\n  象曰：凤凰落在西岐山，长鸣几声出圣贤，天降文王开基业，富贵荣华八百年。这个卦是异卦（下兑上乾）相叠，乾为天；兑为泽，以天喻君，以泽喻民，原文：“履（踩）虎尾、不咥（咬）人。”因此，结果吉利。君上民下，各得其位。兑柔遇乾刚，所履危。履意为实践，卦义是脚踏实地的向前进取的意思。",
        "泰" to "第11卦\n  地天泰（泰卦）应时而变\n  中中卦\n  象曰：学文满腹入场闱，三元及第得意回，从今解去愁和闷，喜庆平地一声雷。这个卦是异卦（下乾上坤）相叠，乾为天，为阳；坤为地，为阴，阴阳交感，上下互通，天地相交，万物纷纭。反之则凶。万事万物，皆对立，转化，盛极必衰，衰而转盛，故应时而变者泰（通）。",
        "否" to "第12卦\n  天地否(pǐ)（否卦）不交不通\n  中中卦\n  象曰：虎落陷坑不堪言，进前容易退后难，谋望不遂自己便，疾病口舌事牵连。这个卦是异卦（下坤上乾）相叠，其结构同泰卦相反，系阳气上升，阴气下降，天地不交，万物不通。它们彼此为“综卦”，表明泰极而否，否极泰来，互为因果。",
        "同人" to "第13卦\n  天火同人（同人卦）上下和同\n  中上卦\n  象曰：心中有事犯猜疑，谋望从前不着实，幸遇明人来指引，诸般忧闷自消之。这个卦是异卦（下离上乾）相叠，乾为天，为君；离为火，为臣民百姓，上天下火，火性上升，同于天，上下和同，同舟共济，人际关系和谐，天下大同。",
        "大有" to "第14卦\n  火天大有（大有卦）顺天依时\n  上上卦\n  象曰：砍树摸雀作事牢，是非口舌自然消，婚姻合伙不费力，若问走失未逃脱。这个卦是异卦（下乾上离）相叠。上卦为离，为火；下卦为乾，为天。火在天上，普照万物，万民归顺，顺天依时，大有所成。",
        "謙" to "第15卦\n  地山谦（谦卦）内高外低\n  中中卦\n  象曰：天赐贫人一封金，不争不抢两平分，彼此分得金到手，一切谋望皆遂心。这个卦是异卦（下艮上坤）相叠，艮为山，坤为地。地面有山，地卑（低）而山高，是为内高外低，比喻功高不自居，名高不自誉，位高不自傲。这就是谦。",
        "豫" to "第16卦\n  雷地豫（豫卦）顺时依势\n  中中卦\n  象曰：太公插下杏黄旗，收妖为徒归西岐，自此青龙得了位，一旦谋望百事宜。这个卦是异卦（下坤上震）相叠，坤为地，为顺；震为雷，为动。雷依时出，预示大地回春。因顺而动，和乐之源。此卦与谦卦互为综卦，交互作用。",
        "随" to "第17卦\n  泽雷随（随卦）随时变通\n  中中卦\n  象曰：泥里步踏这几年，推车靠崖在眼前，目下就该再使力，扒上崖去发财源。这个卦是异卦（下震上兑）相叠，震为雷、为动；兑为悦。动而悦就是“随”。随指相互顺从，己有随物，物能随己，彼此沟通。随必依时顺势，有原则和条件，以坚贞为前提。",
        "蠱" to "第18卦\n  山风蛊（蛊卦）振疲起衰\n  中中卦\n  象曰：卦中爻象如推磨，顺当为福反为祸，心中有益且迟迟，凡事尽从忙处错。这个卦是异卦（下巽上艮）相叠，与随卦互为综卦。蛊（gu）本意为事，引申为多事、混乱。器皿久不用而生虫称“蛊”，喻天下久安而因循、腐败，必须革新创造，治理整顿，挽救危机，重振事业。",
        "臨" to "第19卦\n  地泽临（临卦）教民保民\n  中上卦\n  象曰：君王无道民倒悬，常想拨云见青天，幸逢明主施仁政，重又安居乐自然。这个卦是异卦（下兑上坤）相叠。坤为地；兑为泽，地高于泽，泽容于地。喻君主亲临天下，治国安邦，上下融洽。",
        "觀" to "第20卦\n  风地观（观卦）观下瞻上\n  中上卦\n  象曰：卦遇蓬花旱逢河，生意买卖利息多，婚姻自有人来助，出门永不受折磨。这个卦是异卦（下坤上巽）相叠，风行地上，喻德教遍施。观卦与临卦互为综卦，交相使用。在上者以道义观天下；在下者以敬仰瞻上，人心顺服归从。",
        "噬嗑" to "第21卦\n  火雷噬嗑（噬嗑卦）刚柔相济\n  上上卦\n  象曰：运拙如同身受饥，幸得送饭又送食，适口充腹心欢喜，忧愁从此渐消移。这个卦是异卦（下震上离）相叠。离为阴卦；震为阳卦。阴阳相交，咬碎硬物，喻恩威并施，宽严结合，刚柔相济。噬嗑（shihe）为上下颚咬合，咀嚼。",
        "贲" to "第22卦\n  山火贲（贲卦）饰外扬质\n  中上卦\n  钟鼓乐之大吉庆，占者逢之喜临头。这个卦是异卦（下离上艮）相叠。离为火为明；艮为山为止。文明而有节制。贲（bi）卦论述文与质的关系，以质为主，以文调节。贲，文饰、修饰。",
        "剝" to "第23卦\n  山地剥（剥卦）顺势而止\n  中下卦\n  象曰：鹊遇天晚宿林中，不知林内先有鹰，虽然同处心生恶，卦若逢之是非轻。这个卦是异卦（下坤上艮）相叠。五阴在下，一阳在上，阴盛而阳孤；高山附于地。二者都是剥落象，故为“剥卦”。此卦阴盛阳衰，喻小人得势，君子困顿，事业败坏。",
        "複" to "第24卦\n  地雷复（复卦）寓动于顺\n  中中卦\n  象曰：马氏太公不相合，世人占之忧疑多，恩人无义反为怨，是非平地起风波。这个卦是异卦（下震上坤）相叠。震为雷、为动；坤为地、为顺，动则顺，顺其自然。动在顺中，内阳外阴，循序运动，进退自如，利于前进。",
        "無妄" to "第25卦\n  天雷无妄（无妄卦）无妄而得\n  下下卦\n  象曰：飞鸟失机落笼中，纵然奋飞不能腾，目下只宜守本分，妄想扒高万不能。这个卦是异卦（下震上乾）相叠。乾为天为刚为健；震为雷为刚为动。动而健，刚阳盛，人心振奋，必有所得，但唯循纯正，不可妄行。无妄必有获，必可致福。",
        "大畜" to "第26卦\n  山天大畜（大畜卦）止而不止\n  中上卦\n  象曰：忧愁常锁两眉头，千头万绪挂心间，从今以后防开阵，任意行而不相干。这个卦是异卦（下乾上艮）相叠。乾为天，刚健；艮为山，笃实。畜者积聚，大畜意为大积蓄。为此不畏严重的艰难险阻，努力修身养性以丰富德业。",
        "頤" to "第27卦\n  山雷颐（颐卦）纯正以养\n  上上卦\n  象曰：太公独钓渭水河，手执丝杆忧愁多，时来又遇文王访，自此永不受折磨。这个卦是异卦（下震上艮）相叠。震为雷，艮为山。山在上而雷在下，外实内虚。春暖万物养育，依时养贤育民。阳实阴虚，实者养人，虚者为人养。自食其力。",
        "大過" to "第28卦\n  泽风大过（大过卦）非常行动\n  中下卦\n  象曰：夜晚梦里梦金银，醒来仍不见一文，目下只宜求本分，思想络是空劳神。这个卦是异卦（下巽上兑）相叠。兑为泽、为悦，巽为木、为顺，泽水淹舟，遂成大错。阴阳爻相反，阳大阴小，行动非常，有过度形象，内刚外柔。",
        "坎" to "第29卦\n  坎为水（坎卦）行险用险\n  下下卦\n  象曰：一轮明月照水中，只见影儿不见踪，愚夫当财下去取，摸来摸去一场空。这个卦是同卦（下坎上坎）相叠。坎为水、为险，两坎相重，险上加险，险阻重重。一阳陷二阴。所幸阴虚阳实，诚信可豁然贯通。虽险难重重，却方能显人性光彩。",
        "離" to "第30卦\n  离为火（离卦）附和依托\n  中上卦\n  象曰：官人来占主高升，庄农人家产业增，生意买卖利息厚，匠艺占之大亨通。这个卦是同卦（下离上离）相叠。离者丽也，附着之意，一阴附丽，上下二阳，该卦象征火，内空外明。离为火、为明、太阳反复升落，运行不息，柔顺为心。",
        "鹹" to "第31卦\n  泽山咸（咸卦）相互感应\n  中上卦\n  象曰：运去黄金失色，时来棒槌发芽，月令极好无差，且喜心宽意大。这个卦是异卦（下艮上兑）相叠。艮为山；泽为水。兑柔在上，艮刚在下，水向下渗，柔上而刚下，交相感应。感则成。",
        "恒" to "第32卦\n  雷风恒（恒卦）恒心有成\n  中上卦\n  象曰：渔翁寻鱼运气好，鱼来撞网跑不了，别人使本挣不来，谁想一到就凑合。这个卦是异卦（下巽上震）相叠。震为男、为雷；巽为女、为风。震刚在上，巽柔在下。刚上柔下，造化有常，相互助长。阴阳相应，常情，故称为恒。",
        "遁" to "第33卦\n  天山遁（遁卦）遁世救世\n  下下卦\n  象曰：浓云蔽日不光明，劝君且莫出远行，婚姻求财皆不利，提防口舌到门庭。这个卦是异卦（下艮上乾）相叠。乾为天，艮为山。天下有山，山高天退。阴长阳消，小人得势，君子退隐，明哲保身，伺机救天下。",
        "大壯" to "第34卦\n  雷天大壮（大壮卦）壮勿妄动\n  中上卦\n  象曰：卦占工师得大木，眼前该着走上路，时来运转多顺当，有事自管放心宽。这个卦是异卦（下乾上震）相叠。震为雷；乾为天。乾刚震动。天鸣雷，云雷滚，声势宏大，阳气盛壮，万物生长。刚壮有力故曰壮。大而且壮，故名大壮。四阳壮盛，积极而有所作为，上正下正，标正影直。",
        "晉" to "第35卦\n  火地晋（晋卦）求进发展\n  中上卦\n  象曰：锄地锄去苗里草，谁想财帛将人找，一锄锄出银子来，这个运气也算好。这个卦是异卦（下坤上离）相叠。离为日，为光明；坤为地。太阳高悬，普照大地，大地卑顺，万物生长，光明磊落，柔进上行，喻事业蒸蒸日上。",
        "明夷" to "第36卦\n  地火明夷（明夷卦）晦而转明\n  中下卦\n  象曰：时乖运拙走不着，急忙过河拆了桥，恩人无义反为怨，凡事无功枉受劳。这个卦是异卦（下离上坤）相叠。离为明，坤为顺；离为日；坤为地。日没入地，光明受损，前途不明，环境困难，宜遵时养晦，坚守正道，外愚内慧，韬光养晦。",
        "家人" to "第37卦\n  风火家人（家人卦）诚威治业\n  下下卦\n  象曰：一朵鲜花镜中开，看着极好取不来，劝君休把镜花恋，卦若逢之主可怪。这个卦是异卦（下离上巽）相叠。离为火；巽为风。火使热气上升，成为风。一切事物皆应以内在为本，然后伸延到外。发生于内，形成于外。喻先治家而后治天下，家道正，天下安乐。",
        "睽" to "第38卦\n  火泽睽（睽卦）异中求同\n  下下卦\n  象曰：此卦占来运气歹，如同太公作买卖，贩猪牛快贩羊迟，猪羊齐贩断了宰。这个卦是异卦（下兑上离）相叠。离为火；兑为泽。上火下泽，相违不相济。克则生，往复无空。万物有所不同，必有所异，相互矛盾。睽即矛盾。",
        "蹇" to "第39卦\n  水山蹇（蹇卦）险阻在前\n  下下卦\n  象曰：大雨倾地雪满天，路上行人苦又寒，拖泥带水费尽力，事不遂心且耐烦。这个卦是异卦（下艮上坎）相叠。坎为水；艮为山。山高水深，困难重重，人生险阻，见险而止，明哲保身，可谓智慧。蹇，跋行艰难。",
        "解" to "第40卦\n  雷水解（解卦）柔道致治\n  中上卦\n  象曰：目下月令如过关，千辛万苦受熬煎，时来恰相有人救，任意所为不相干。这个卦是异卦（下坎上震）相叠。震为雷、为动；坎为水、为险。险在内，动在外。严冬天地闭塞，静极而动。万象更新，冬去春来，一切消除，是为解。",
        "損" to "第41卦\n  山泽损（损卦）损益制衡\n  下下卦\n  象曰：时运不至费心多，比作推车受折磨，山路崎岖吊下耳，左插右按按不着。这个卦是异卦（下兑上艮）相叠。艮为山；兑为泽。上山下泽，大泽浸蚀山根。损益相间，损中有益，益中有损。二者之间，不可不慎重对待。损下益上，治理国家，过度会损伤国基。应损则损，但必量力、适度。少损而益最佳。",
        "益" to "第42卦\n  风雷益（益卦）损上益下\n  上上卦\n  象曰：时来运转吉气发，多年枯木又开花，枝叶重生多茂盛，几人见了几人夸。这个卦是异卦（下震上巽）相叠。巽为风；震为雷。风雷激荡，其势愈强，雷愈响，风雷相助互长，交相助益。此卦与损卦相反。它是损上以益下，后者是损下以益上。二卦阐述的是损益的原则。",
        "夬" to " 第43卦\n  泽天夬 （夬卦） 决而能和\n  上上卦\n  象曰：蜘蛛脱网赛天军，粘住游蜂翅翎毛，幸有大风吹破网，脱离灾难又逍遥。这个卦是异卦（下乾上兑）相叠。乾为天为健；兑为泽为悦。泽气上升，决注成雨，雨施大地，滋润万物。五阳去一阴，去之不难，决（去之意）即可，故名为夬（guài），夬即决。",
        "姤" to "第44卦\n  天风姤（姤卦） 天下有风\n  上卦\n  象曰：他乡遇友喜气欢，须知运气福重添，自今交了顺当运，向后管保不相干。这个卦是异卦（下巽上乾）相叠。乾为天；巽为风。天下有风，吹遍大地，阴阳交合，万物茂盛。姤（gǒu）卦与夬卦相反，互为“综卦”。姤即遘，阴阳相遇。但五阳一阴，不能长久相处。",
        "萃" to "第45卦\n  泽地萃（萃卦）荟萃聚集\n  中上卦\n  象曰：游鱼戏水被网惊，跳过龙门身化龙，三尺杨柳垂金线，万朵桃花显你能。这个卦是异卦相叠（下坤上兑）。坤为地、为顺；兑为泽、为水。泽泛滥淹没大地，人众多相互斗争，危机必四伏，务必顺天任贤，未雨绸缪，柔顺而又和悦，彼此相得益彰，安居乐业。萃，聚集、团结。",
        "升" to " 第46卦\n  地风升（升卦）柔顺谦虚\n  上上卦\n  象曰：士人来占必得名，生意买卖也兴隆，匠艺逢之交易好，农间庄稼亦收成。这个卦是异卦相叠（下巽上坤）。坤为地、为顺；巽为木、为逊。大地生长树木，逐步的成长，日渐高大成材，喻事业步步高升，前程远大，故名“升”。",
        "困" to "第47卦\n  泽水困（困卦）困境求通\n  中上卦\n  象曰：时运不来好伤怀，撮上押去把梯抬，一筒虫翼无到手，转了上去下不来。这个卦是异卦（下坎上兑）相叠。兑为阴为泽喻悦；坎为阳为水喻险。泽水困，陷入困境，才智难以施展，仍坚守正道，自得其乐，必可成事，摆脱困境。",
        "井" to "  第48卦\n  水风井（井卦）求贤若渴\n  上上卦\n  象曰：枯井破费已多年，一朝流泉出来鲜，资生济渴人称羡，时来运转喜自然。这个卦是异卦（下巽上坎）相叠。坎为水；巽为木。树木得水而蓬勃生长。人靠水井生活，水井由人挖掘而成。相互为养，井以水养人，经久不竭，人应取此德而勤劳自勉。",
        "革" to "第49卦\n  泽火革（革卦）顺天应人\n  上上卦\n  象曰：苗逢旱天渐渐衰，幸得天恩降雨来，忧去喜来能变化，求谋干事遂心怀。这个卦是异卦（下离上兑）相叠。离为火；兑为泽，泽内有水。水在上而下浇，火在下而上升。火旺水干；水大火熄。二者相生亦相克，必然出现变革。变革是宇宙的基本规律。",
        "鼎" to " 第50卦\n  火风鼎（鼎卦）稳重图变\n  中下卦\n  象曰：莺鹜蛤蜊落沙滩，蛤蜊莺鹜两翅扇，渔人进前双得利，失走行人却自在。这个卦是异卦（下巽上离）相叠。燃木煮食，化生为熟，除旧布新的意思。鼎为重宝大器，三足稳重之象。煮食，喻食物充足，不再有困难和困扰。在此基础上宜变革，发展事业。",
        "震" to "第51卦\n  震为雷（震卦）临危不乱\n  中上卦\n  象曰：一口金钟在淤泥，人人拿着当玩石，忽然一日钟悬起，响亮一声天下知。这个卦是同卦（下震上震）相叠。震为雷，两震相叠，反响巨大，可消除沉闷之气，亨通畅达。平日应居安思危，怀恐惧心理，不敢有所怠慢，遇到突发事变，也能安然自若，谈笑如常。",
        "艮" to "第52卦\n  艮为山（艮卦）动静适时\n  中下卦\n  象曰：财帛常打心头走，可惜眼前难到手，不如意时且忍耐，逢着闲事休开口。这个卦是同卦（下艮上艮）相叠。艮为山，二山相重，喻静止。它和震卦相反。高潮过后，必然出现低潮，进入事物的相对静止阶段。静止如山，宜止则止，宜行则行。行止即动和静，都不可失机，应恰到好处，动静得宜，适可而止。",
        "漸" to "第53卦\n  风山渐（渐卦）渐进蓄德\n  上上卦\n  象曰：俊鸟幸得出笼中，脱离灾难显威风，一朝得意福力至，东西南北任意行。这个卦是异卦（下艮上巽）相叠。艮为山；巽为木。山上有木，逐渐成长，山也随着增高。这是逐渐进步的过程，所以称渐，渐即进，渐渐前进而不急速。",
        "歸妹" to "第54卦\n  雷泽归妹（归妹卦）立家兴业\n  下下卦\n  象曰：求鱼须当向水中，树上求之不顺情，受尽爬揭难随意，劳而无功运平平。这个卦是异卦（下兑上震）相叠。震为动、为长男；兑为悦、为少女。以少女从长男，产生爱慕之情，有婚姻之动，有嫁女之象，故称归妹。男婚女嫁，天地大义，人的开始和终结。上卦与渐卦为综卦，交互为用。",
        "豐" to "第55卦\n  雷火丰（丰卦）日中则斜\n  上上卦\n  象曰：古镜昏暗好几年，一朝磨明似月圆，君子谋事逢此卦，时来运转喜自然。这个卦是异卦（下离上震）相叠，电闪雷鸣，成就巨大，喻达到顶峰，如日中天。告诫；务必注意事物向相反方面发展。治乱相因，盛衰无常，不可不警惕。",
        "旅" to "第56卦\n  火山旅（旅卦）依义顺时\n  下下卦\n  象曰：飞鸟树上垒窝巢，小人使计举火烧，君占此卦为不吉，一切谋望枉徒劳。这个卦是异卦（下艮上离）相叠。此卦与丰卦相反，互为“综卦”。山中燃火，烧而不止，火势不停地向前蔓延，如同途中行人，急于赶路。因而称旅卦。",
        "巽" to "第57卦\n  巽为风（巽卦）谦逊受益\n  中上卦\n  象曰：一叶孤舟落沙滩，有篙无水进退难，时逢大雨江湖溢，不用费力任往返。这个卦是同卦（下巽上巽）相叠，巽（xùn）为风，两风相重，长风不绝，无孔不入，巽义为顺。谦逊的态度和行为可无往不利。",
        "兌" to "第58卦\n  兑为泽（泽卦）刚内柔外\n  上上卦\n  象曰：这个卦象真可取，觉着做事不费力，休要错过这机关，事事觉得随心意。这个卦是同卦（下泽上泽）相叠。泽为水。两泽相连，两水交流，上下相和，团结一致，朋友相助，欢欣喜悦。兑为悦也。同秉刚健之德，外抱柔和之姿，坚行正道，导民向上。",
        "渙" to " 第59卦\n  风水涣（涣卦）拯救涣散\n  下下卦\n  象曰：隔河望见一锭金，欲取岸宽水又深，指望资财难到手，昼思夜想枉费心。这个卦是异卦（下坎上巽）相叠。风在水上行，推波助澜，四方流溢。涣，水流流散之意。象征组织和人心涣散，必用积极的手段和方法克服，战胜弊端，挽救涣散，转危为安。",
        "節" to "第60卦\n  水泽节（节卦）万物有节\n  上上卦\n  象曰：时来运转喜气生，登台封神姜太公，到此诸神皆退位，纵然有祸不成凶。这个卦是异卦（下兑上坎）相叠。兑为泽；坎为水。泽有水而流有限，多必溢于泽外。因此要有节度，故称节。节卦与涣卦相反，互为综卦，交相使用。天地有节度才能常新，国家有节度才能安稳，个人有节度才能完美。",
        "中孚" to "第61卦\n  风泽中孚（中孚卦）诚信立身\n  下下卦\n  象曰：路上行人色匆匆，急忙无桥过薄冰，小心谨慎过得去，一步错了落水中。这个卦是异卦（下兑上巽）相叠。孚（fú）本义孵，孵卵出壳的日期非常准确，有信的意义。卦形外实内虚，喻心中诚信，所以称中孚卦。这是立身处世的根本。",
        "小過" to "第62卦\n  雷山小过（小过卦）行动有度\n  中上卦\n  象曰：行人路过独木桥，心内惶恐眼里瞧，爽利保你过得去，慢行一定不安牢。这个卦是异卦（下艮上震）相叠。艮为山；震为雷。过山雷鸣，不可不畏惧。阳为大，阴为小，卦外四阴超过中二阳，故称“小过”，小有越过。",
        "既濟" to "第63卦\n  水火既济（既济卦）盛极将衰\n  中上卦\n  象曰：金榜以上题姓名，不负当年苦用功，人逢此卦名吉庆，一切谋望大亨通。这个卦是异卦（下离上坎）相叠。坎为水；离为火。水火相交，水在火上，水势压倒火势，救火大功告成。既，已经；济，成也。既济就是事情已经成功，但终将发生变故。",
        "未濟" to "第64卦\n  火水未济（未济卦）事业未竟\n  中下卦\n  象曰：离地着人几丈深，是防偷营劫寨人，后封太岁为凶煞，时加谨慎祸不侵。这个卦是异卦（下坎上离）相叠。离为火；坎为水。火上水下，火势压倒水势，救火大功未成，故称未济。《周易》以乾坤二卦为始，以既济、未济二卦为终，充分反映了变化发展的思想。"
)
//把卦名转换为 符号
private val TEXT_MAP_TABLE = hashMapOf(
        "乾" to "䷀",
        "坤" to "䷁",
        "屯" to "䷂",
        "蒙" to "䷃",
        "需" to "䷄",
        "訟" to "䷅",
        "師" to "䷆",
        "比" to "䷇",
        "小畜" to "䷈",
        "履" to "䷉",
        "泰" to "䷊",
        "否" to "䷋",
        "同人" to "䷌",
        "大有" to "䷍",
        "謙" to "䷎",
        "豫" to "䷏",
        "隨" to "䷐",
        "蠱" to "䷑",
        "臨" to "䷒",
        "觀" to "䷓",
        "噬嗑" to "䷔",
        "贲" to "䷕",
        "剝" to "䷖",
        "複" to "䷗",
        "無妄" to "䷘",
        "大畜" to "䷙",
        "頤" to "䷚",
        "大過" to "䷛",
        "坎" to "䷜",
        "離" to "䷝",
        "鹹" to "䷞",
        "恒" to "䷟",
        "遁" to "䷠",
        "大壯" to "䷡",
        "晉" to "䷢",
        "明夷" to "䷣",
        "家人" to "䷤",
        "睽" to "䷥",
        "蹇" to "䷦",
        "解" to "䷧",
        "損" to "䷨",
        "益" to "䷩",
        "夬" to "䷪",
        "姤" to "䷫",
        "萃" to "䷬",
        "升" to "䷭",
        "困" to "䷮",
        "井" to "䷯",
        "革" to "䷰",
        "鼎" to "䷱",
        "震" to "䷲",
        "艮" to "䷳",
        "漸" to "䷴",
        "歸妹" to "䷵",
        "豐" to "䷶",
        "旅" to "䷷",
        "巽" to "䷸",
        "兌" to "䷹",
        "渙" to "䷺",
        "節" to "䷻",
        "中孚" to "䷼",
        "小過" to "䷽",
        "既濟" to "䷾",
        "未濟" to "䷿"
)
private val TEXT_GOSSIP_TO_BINARY_TABLE = hashMapOf(
        "111111" to "乾",
        "000000" to "坤",
        "010001" to "屯",
        "100010" to "蒙",
        "010111" to "需",
        "111010" to "訟",
        "000010" to "師",
        "010000" to "比",
        "110111" to "小畜",
        "111011" to "履",
        "000111" to "泰",
        "111000" to "否",
        "111101" to "同人",
        "101111" to "大有",
        "000100" to "謙",
        "001000" to "豫",
        "011001" to "隨",
        "100110" to "蠱",
        "000011" to "臨",
        "110000" to "觀",
        "101001" to "噬嗑",
        "100101" to "贲",
        "100000" to "剝",
        "000001" to "複",
        "111001" to "無妄",
        "100111" to "大畜",
        "100001" to "頤",
        "011110" to "大過",
        "010010" to "坎",
        "101101" to "離",
        "011100" to "鹹",
        "001110" to "恒",
        "111100" to "遁",
        "001111" to "大壯",
        "101000" to "晉",
        "000101" to "明夷",
        "110101" to "家人",
        "101011" to "睽",
        "010100" to "蹇",
        "001010" to "解",
        "100011" to "損",
        "110001" to "益",
        "011111" to "夬",
        "111110" to "姤",
        "011000" to "萃",
        "000110" to "升",
        "011010" to "困",
        "010110" to "井",
        "011101" to "革",
        "101110" to "鼎",
        "001001" to "震",
        "100100" to "艮",
        "110100" to "漸",
        "001011" to "歸妹",
        "001101" to "豐",
        "101100" to "旅",
        "110110" to "巽",
        "011011" to "兌",
        "110010" to "渙",
        "010011" to "節",
        "110011" to "中孚",
        "001100" to "小過",
        "010101" to "既濟",
        "101010" to "未濟"
)
//把符号转换为卦名
private val ENCODE_MAP_TABLE = hashMapOf(
        "A" to "䷀",
        "B" to "䷁",
        "C" to "䷂",
        "D" to "䷃",
        "E" to "䷄",
        "F" to "䷅",
        "G" to "䷆",
        "H" to "䷇",
        "I" to "䷈",
        "J" to "䷉",
        "K" to "䷊",
        "L" to "䷋",
        "M" to "䷌",
        "N" to "䷍",
        "O" to "䷎",
        "P" to "䷏",
        "Q" to "䷐",
        "R" to "䷑",
        "S" to "䷒",
        "T" to "䷓",
        "U" to "䷔",
        "V" to "䷕",
        "W" to "䷖",
        "X" to "䷗",
        "Y" to "䷘",
        "Z" to "䷙",
        "a" to "䷚",
        "b" to "䷛",
        "c" to "䷜",
        "d" to "䷝",
        "e" to "䷞",
        "f" to "䷟",
        "g" to "䷠",
        "h" to "䷡",
        "i" to "䷢",
        "j" to "䷣",
        "k" to "䷤",
        "l" to "䷥",
        "m" to "䷦",
        "n" to "䷧",
        "o" to "䷨",
        "p" to "䷩",
        "q" to "䷪",
        "r" to "䷫",
        "s" to "䷬",
        "t" to "䷭",
        "u" to "䷮",
        "v" to "䷯",
        "w" to "䷰",
        "x" to "䷱",
        "y" to "䷲",
        "z" to "䷳",
        "0" to "䷴",
        "1" to "䷵",
        "2" to "䷶",
        "3" to "䷷",
        "4" to "䷸",
        "5" to "䷹",
        "6" to "䷺",
        "7" to "䷻",
        "8" to "䷼",
        "9" to "䷽",
        "+" to "䷾",
        "/" to "䷿"
)
//把64卦符号对应字母数字
private val DECODE_MAP_TABLE = hashMapOf(
        "䷀" to "A",
        "䷁" to "B",
        "䷂" to "C",
        "䷃" to "D",
        "䷄" to "E",
        "䷅" to "F",
        "䷆" to "G",
        "䷇" to "H",
        "䷈" to "I",
        "䷉" to "J",
        "䷊" to "K",
        "䷋" to "L",
        "䷌" to "M",
        "䷍" to "N",
        "䷎" to "O",
        "䷏" to "P",
        "䷐" to "Q",
        "䷑" to "R",
        "䷒" to "S",
        "䷓" to "T",
        "䷔" to "U",
        "䷕" to "V",
        "䷖" to "W",
        "䷗" to "X",
        "䷘" to "Y",
        "䷙" to "Z",
        "䷚" to "a",
        "䷛" to "b",
        "䷜" to "c",
        "䷝" to "d",
        "䷞" to "e",
        "䷟" to "f",
        "䷠" to "g",
        "䷡" to "h",
        "䷢" to "i",
        "䷣" to "j",
        "䷤" to "k",
        "䷥" to "l",
        "䷦" to "m",
        "䷧" to "n",
        "䷨" to "o",
        "䷩" to "p",
        "䷪" to "q",
        "䷫" to "r",
        "䷬" to "s",
        "䷭" to "t",
        "䷮" to "u",
        "䷯" to "v",
        "䷰" to "w",
        "䷱" to "x",
        "䷲" to "y",
        "䷳" to "z",
        "䷴" to "0",
        "䷵" to "1",
        "䷶" to "2",
        "䷷" to "3",
        "䷸" to "4",
        "䷹" to "5",
        "䷺" to "6",
        "䷻" to "7",
        "䷼" to "8",
        "䷽" to "9",
        "䷾" to "+",
        "䷿" to "/"
)
private val HZ_BH_TABLE = hashMapOf(
        "1" to "一乙",
        "2" to "丁七乃乜九了二人亻儿入八冂几凵刀刁力勹匕十厂厶又",
        "3" to "万丈三上下丌个丫丸久乇么义乞也习乡亍于亏亡亿兀凡刃勺千卫叉口囗土士夕大女子孑孓寸小尢尸山巛川工己已巳巾干幺广廾弋弓才门飞马",
        "4" to "不与丐丑专中丰丹为之乌书予云互亓五井亢什仁仂仃仄仅仆仇仉今介仍从仑仓允元公六兮内冈冗凤凶分切刈劝办勾勿匀化匹区卅升午卞厄厅历及友双反壬天太夫夭孔少尤尹尺屯巴币幻廿开引心忆戈户手扎支攴攵文斗斤方无日曰月木欠止歹殳毋比毛氏气水火爪父爻爿片牙牛犬王瓦肀艺见计订讣认讥贝车邓长闩队韦风且丕世丘丙业丛东丝主乍乎乏",
        "5" to "乐仔仕他仗付仙仝仞仟仡代令以仨仪仫们兄兰冉册写冬冯凸凹出击刊刍功加务劢包匆北匝卉半卟占卡卢卮卯厉去发古句另叨叩只叫召叭叮可台叱史右叵叶号司叹叻叼叽囚四圣处外央夯失头奴奶孕宁它宄对尔尕尻尼左巧巨市布帅平幼庀弁弗弘归必忉戊戋扑扒打扔斥旦旧未末本札术正母氐民氕永汀汁汇汉灭犯犰玄玉瓜甘生用甩田由甲申电疋白皮皿目矛矢石示礼禾穴立纠艽艾艿节讦讧讨让讪讫训议讯记轧边辽邗邙邛邝钅闪阡阢饥驭鸟龙",
        "6" to "丞丢乒乓乔乩买争亘亚交亥亦产仰仲仳仵件价任份仿企伉伊伍伎伏伐休众优伙会伛伞伟传伢伤伥伦伧伪伫佤充兆先光全共关兴再军农冰冱冲决凫凼刎刑划刖列刘则刚创劣动匈匠匡华协印危压厌厍吁吃各吆合吉吊同名后吏吐向吒吓吕吖吗囝回囟因囡团在圩圪圬圭圮圯地圳圹场圾壮夙多夷夸夹夺夼奸她好妁如妃妄妆妇妈字存孙宅宇守安寺寻导尖尘尥尧尽屹屺屿岁岂岌州巡巩帆师年并庄庆延廷异式弛当忏忖忙戌戍戎戏成托扛扣扦执扩扪扫扬收旨早旬旭旮旯曲曳有朱朴朵机朽杀杂权次欢此死毕氖氘氽汆汊汐汔汕汗汛汜汝江池污汤汲灯灰爷牝牟犴犷犸玎玑百祁竹米糸纡红纣纤纥约级纨纩纪纫缶网羊羽老考而耒耳聿肉肋肌臣自至臼舌舛舟艮色芄芊芋芍芎芏芑芒芗芝芨虍虫血行衣西观讲讳讴讵讶讷许讹论讼讽设访诀贞负轨达迁迂迄迅过迈邡邢那邦邪邬钆钇闫闭问闯阪阮阱防阳阴阵阶页饧驮驯驰齐",
        "7" to "两严串丽乱亨亩伯估伲伴伶伸伺似伽佃但位低住佐佑体何佗佘余佚佛作佝佞佟你佣佥佧克免兑兕兵况冶冷冻初删判刨利别刭助努劫劬劭励劲劳匣医卣卤即却卵县君吝吞吟吠吡吣否吧吨吩含听吭吮启吱吲吴吵吸吹吻吼吾呀呃呆呈告呋呐呒呓呔呕呖呗员呙呛呜囤囫园困囱围囵圻址坂均坊坌坍坎坏坐坑块坚坛坜坝坞坟坠声壳奁奂妊妍妒妓妖妗妙妞妣妤妥妨妩妪妫姊姒孚孛孜孝宋完宏寿尬尾尿局屁层岈岍岐岑岔岖岗岘岙岚岛岜希帏帐庇床庋序庐庑库应弃弄弟张形彤彷役彻忌忍忐忑忒志忘忡忤忧忪快忭忮忱忸忻忾怀怃怄怅怆我戒扭扮扯扰扳扶批扼找技抄抉把抑抒抓投抖抗折抚抛抟抠抡抢护报拒拟攸改攻旰旱时旷更杆杈杉杌李杏材村杓杖杜杞束杠条来杨杩极欤步歼每氙氚求汞汨汩汪汰汴汶汹汽汾沁沂沃沅沆沈沉沌沏沐沔沙沛沟没沣沤沥沦沧沩沪泐泛灵灶灸灼灾灿炀牡牢状犹狁狂狃狄狈玖玛甫甬男甸町疔疖疗皂盯矣矶社祀秀私秃究穷系纬纭纯纰纱纲纳纵纶纷纸纹纺纽纾罕羌肓肖肘肚肛肜肝肟肠良芈芘芙芜芟芡芤芥芦芩芪芫芬芭芮芯芰花芳芴芷芸芹芽芾苁苄苇苈苊苋苌苍苎苏苡苣虬补角言证诂诃评诅识诈诉诊诋诌词诎诏译诒谷豆豕豸贡财赤走足身轩轫辛辰迎运近迓返迕还这进远违连迟邑邮邯邰邱邳邴邵邶邸邹邺邻酉里针钉钊钋钌闰闱闲闳间闵闶闷阻阼阽阿陀陂附际陆陇陈陉韧饨饩饪饫饬饭饮驱驳驴鸠鸡麦龟",
        "8" to "丧乖乳事些亟享京佩佬佯佰佳佴佶佻佼佾使侃侄侈侉例侍侏侑侔侗供依侠侣侥侦侧侨侩侪侬兔兖其具典冼冽净凭凯函刮到刳制刷券刹刺刻刽刿剀剁剂劾势匦卑卒卓单卖卦卧卷卺厕叁参叔取呢呤呦周呱味呵呶呷呸呻呼命咀咂咄咆咋和咎咏咐咒咔咕咖咙咚咛咝哎囹固国图坡坤坦坨坩坪坫坭坯坳坶坷坻坼垂垃垄垅垆备夜奄奇奈奉奋奔妮妯妲妹妻妾姆始姐姑姓委姗孟孢季孤孥学宓宕宗官宙定宛宜宝实宠审尚居屈屉届岢岣岩岫岬岭岱岳岵岷岸岽岿峁峄巫帑帔帕帖帘帙帚帛帜幸底庖店庙庚府庞废建弥弦弧弩弪录彼往征徂径忝忠念忽忿态怂怊怍怏怔怕怖怙怛怜怡怦性怩怪怫怯怵怿戕或戗戽戾房所承抨披抬抱抵抹抻押抽抿拂拄担拆拇拈拉拊拌拍拎拐拓拔拖拗拘拙拚招拢拣拥拦拧拨择放斧斩於旺昀昂昃昆昊昌明昏易昔昕昙朊朋服杪杭杯杰杲杳杵杷杼松板构枇枉枋析枕林枘枚果枝枞枢枣枥枧枨枪枫枭柜欣欧武歧殁殴氓氛沓沫沭沮沱沲河沸油治沼沽沾沿泄泅泊泌泓泔法泖泗泞泠泡波泣泥注泪泫泮泯泱泳泷泸泺泻泼泽泾浅炅炉炊炎炒炔炕炖炙炜炝炬爬爸版牦牧物狍狎狐狒狗狙狞玟玢玩玫玮环现瓮瓯甙画甾畀畅疙疚疝疟疠疡的盂盱盲直知矸矽矾矿砀码祆祈祉秆秉穸穹空竺籴线绀绁绂练组绅细织终绉绊绋绌绍绎经绐罔罗者耵耶肃股肢肤肥肩肪肫肭肮肯肱育肴肷肺肼肽肾肿胀胁臾舍艰苑苒苓苔苕苗苘苛苜苞苟苠苤若苦苫苯英苴苷苹苻茁茂范茄茅茆茇茉茌茎茏茑茔茕茚虎虏虮虱表衩衫衬规觅视诓诔试诖诗诘诙诚诛诜话诞诟诠诡询诣诤该详诧诨诩责贤败账货质贩贪贫贬购贮贯转轭轮软轰迢迤迥迦迨迩迪迫迭迮述迳邾郁郄郅郇郊郎郏郐郑郓采金钍钎钏钐钒钓钔钕钗闸闹阜陋陌降限陔陕隶隹雨青非顶顷饯饰饱饲饴驵驶驷驸驹驺驻驼驽驾驿骀鱼鸢鸣黾齿",
        "9" to "临举亭亮亲侮侯侵便促俄俅俊俎俏俐俑俗俘俚俜保俞俟信俣俦俨俩俪俭修兹养冒冠剃削剌前剐剑勃勇勉勋匍南卸厘厚受变叙叛呲咣咤咦咧咨咩咪咫咬咭咯咱咳咴咸咻咽咿哀品哂哄哆哇哈哉哌响哏哐哑哒哓哔哕哗哙哚哜哝哞哟哪囿型垌垒垓垛垠垡垢垣垤垦垧垩垫垭垮垲垴城埏复奎奏契奕奖姘姚姜姝姣姥姨姹姻姿威娃娄娅娆娇娈娜孩孪客宣室宥宦宪宫封将尜尝屋屎屏峋峒峙峡峤峥峦差巷帝带帧帮幽庠庥度庭弈弭弯彖彦彪待徇很徉徊律後怎怒思怠急怨总怼恂恃恍恒恢恤恨恪恫恬恸恹恺恻恼恽战扁扃拜括拭拮拯拱拴拶拷拼拽拾持挂指按挎挑挖挝挞挟挠挡挢挣挤挥挪挺政故斫施既昝星映春昧昨昭是昱昴昵昶昼显曷朐枯枰枳枵架枷枸柁柃柄柏某柑柒染柔柘柙柚柝柞柠柢查柩柬柯柰柱柳柽柿栀栅标栈栉栊栋栌栎栏树歪殂殃殄殆殇残段毒毖毗毡氟氡氢泉泵泶洁洄洇洋洌洎洒洗洙洚洛洞津洧洪洫洮洱洲洳洵洹活洼洽派浃浇浈浊测浍济浏浑浒浓浔涎炫炭炮炯炱炳炷炸点炻炼炽烀烁烂烃爰牮牯牲牵狠狡狨狩独狭狮狯狰狱狲玲玳玷玻珀珂珈珉珊珍珏珐珑瓴甚甭畈畋界畎畏疣疤疥疫疬疮疯癸皆皇皈盅盆盈相盹盼盾省眄眇眈眉看眍眨矜矧矩砂砉砌砍砑砒研砖砗砘砚砜砭祓祖祗祚祛祜祝神祠祢禹禺秋种科秒秕秭穿窀突窃窆竖竽竿笃笈类籼籽绑绒结绔绕绗绘给绚绛络绝绞统缸罘罚美羿耍耐耔耷胂胃胄胆背胍胎胖胗胙胚胛胜胝胞胡胤胥胧胨胩胪胫脉舁舡舢舣茈茗茛茜茧茨茫茬茭茯茱茳茴茵茶茸茹茺茼荀荃荆荇草荏荐荑荒荔荚荛荜荞荟荠荡荣荤荥荦荧荨荩荪荫荬荭荮药莒莛虐虹虺虻虼虽虾虿蚀蚁蚂蚤衍衲衽衿袂袄袅要觇览觉訇诫诬语诮误诰诱诲诳说诵诶贰贱贲贳贴贵贶贷贸费贺贻赳赴赵趴轱轲轳轴轵轶轷轸轹轺轻迷迸迹追退送适逃逄逅逆选逊郗郛郜郝郡郢郦郧酊酋重钙钚钛钜钝钞钟钠钡钢钣钤钥钦钧钨钩钪钫钬钭钮钯闺闻闼闽闾阀阁阂陛陟陡院除陧陨险面革韭音顸项顺须飑飒食饵饶饷饺饼首香骁骂骄骅骆骇骈骨鬼鸥鸦鸨鸩",
        "10" to "乘亳俯俱俳俸俺俾倌倍倏倒倔倘候倚倜借倡倥倦倨倩倪倬倭倮债值倾偌健党兼冢冤冥凄准凇凉凋凌剔剖剜剞剡剥剧勐匪匿卿厝原叟哥哦哧哨哩哭哮哲哳哺哼哽哿唁唆唇唉唏唐唑唔唛唠唢唣唤唧啊圃圄圆垸埂埃埋埒埔埕埘埙埚壶夏套奘奚姬娉娌娑娓娘娟娠娣娥娩娱娲娴婀孬宰害宴宵家宸容宽宾射屐屑展屙峨峪峭峰峻崂崃席帱座弱徐徒徕恁恋恐恕恙恚恝恣恧恩恭息恳恶悃悄悌悍悒悔悖悚悛悝悟悦悭悯扇拳拿挈挚挛挨挫振挹挽捂捃捅捆捉捋捌捍捎捏捐捕捞损捡换捣效敉敌敖斋料旁旃旄旅旆晁晃晋晌晏晒晓晔晕晖晚晟朔朕朗柴栓栖栗栝校栩株栲栳样核根格栽栾桀桁桂桃桄桅框案桉桊桌桎桐桑桓桔桕桠桡桢档桤桥桦桧桨桩梃梆梢梧梨殉殊殷毙毪氤氦氧氨氩泰流浆浙浚浜浞浠浣浦浩浪浮浯浴海浸浼涂涅消涉涌涑涓涔涕涛涝涞涟涠涡涣涤润涧涨涩烈烊烘烙烛烟烤烦烧烨烩烫烬热爱爹特牺狳狴狷狸狺狻狼猁猃玺珙珞珠珥珧珩班珲琊瓞瓶瓷畔留畚畛畜疰疱疲疳疴疸疹疼疽疾痂痃痄病症痈痉皋皱益盍盎盏盐监眙眚真眠眢眩砝弢砟砣砥砧砩砬砰破砷砸砹砺砻砼砾础祟祥祧祯离秘租秣秤秦秧秩秫积称窄窈窍站竞笄笆笊笋笏笑笔笕笫粉粑紊素索紧绠绡绢绣绥绦继绨缺罟罡罢羔羞翁翅耄耆耕耖耗耘耙耸耻耽耿聂胭胯胰胱胲胳胴胶胸胺胼能脂脆脊脍脎脏脐脑脒脓臬臭致舀舐舨航舫般舭舯舰舱艳荷荸荻荼荽莅莆莉莎莓莘莜莞莠莨莩莪莫莰莱莲莳莴莶获莸莹莺莼莽虑虔蚊蚋蚌蚍蚓蚕蚜蚝蚣蚧蚨蚩蚪蚬衄衮衰衷衾袁袍袒袖袜袢被觊请诸诹诺读诼诽课诿谀谁谂调谄谅谆谇谈谊豇豹豺贼贽贾贿赀赁赂赃资赅赆赶起趵趸趿躬軎轼载轾轿辁辂较辱逋逍透逐逑递途逖逗通逛逝逞速造逡逢逦邕部郫郭郯郴郸都酌配酎酏酐酒釜钰钱钲钳钴钵钶钷钸钹钺钻钼钽钾钿铀铁铂铃铄铅铆铈铉铊铋铌铍铎阃阄阅阆陪陬陲陴陵陶陷隼隽难顼顽顾顿颀颁颂颃预饽饿馀馁骊骋验骏高髟鬯鬲鸪鸫鸬鸭鸯鸱鸲鸳鸵",
        "11" to "龛鸶龀乾偃假偈偎偏偕做停偬偶偷偻偾偿傀兜兽冕减凑凰剪副勒勖勘匏匐匙匮匾厢厣厩唪唬售唯唰唱唳唷唼唾唿啁啃啄商啉啐啕啖啜啡啤啥啦啧啪啬啭啮啵啶啷啸喏喵圈圉圊埝域埠埤埭埯埴埸培基埽堀堂堆堇堋堍堑堕堵够奢娶娼婆婉婊婕婚婢婧婪婴婵婶孰宿寂寄寅密寇尉屠崆崇崎崔崖崛崞崤崦崧崩崭崮巢帷常帻帼庳庵庶康庸庹庾廊弹彗彩彬得徘徙徜恿悉悠患您悫悬悱悴悸悻悼情惆惊惋惕惘惚惜惝惟惦惧惨惬惭惮惯戚戛扈挲捧捩捭据捱捶捷捺捻掀掂掇授掉掊掎掏掐排掖掘掠探接控推掩措掬掭掮掳掴掷掸掺掼揶敏救敕教敛敝敢斛斜断旋旌旎族晗晡晤晦晨曹曼望桫桴桶桷梁梅梏梓梗梦梭梯械梳梵检棂欲欷殍殒殓毫氪涪涫涮涯液涵涸涿淀淄淅淆淇淋淌淑淖淘淙淝淞淠淡淤淦淫淬淮深淳混淹添清渊渌渍渎渐渑渔渖渗渚渠烯烷烹烽焉焊焐焓焕焖焘爽牾牿犁猊猎猓猕猖猗猛猜猝猞猡猪猫率球琅理琉琏琐瓠甜略畦疵痊痍痒痔痕痖皎皑皲盒盔盖盗盘盛眦眭眯眵眶眷眸眺眼着睁矫砦硅硇硌硎硐硒硕硖硗硭票祭祷祸秸移秽稆窑窒窕竟章笙笛笞笠笤笥符笨笪第笮笱笳笸笺笼笾筇粒粕粗粘粜粝累绩绪绫续绮绯绰绱绲绳维绵绶绷绸绺绻综绽绾绿缀缁缍羚羝羟翊翌翎耜聃聆聊聋职聍胬脖脘脚脞脬脯脱脲脶脸舂舳舴舵舶舷舸船舻艴菀菁菅菇菊菌菏菔菖菘菜菝菟菠菡菥菩菪菰菱菲菸菹菽萁萃萄萆萋萌萍萎萏萑萘萜萝萤营萦萧萨萸著虚蚯蚰蚱蚴蚵蚶蚺蛀蛄蛆蛇蛉蛊蛋蛎蛏衅衔袈袋袤袭袱袷袼裆裉觋觖谋谌谍谎谏谐谑谒谓谔谕谖谗谘谙谚谛谜谝豉豚象赇赈赉赊赦赧趺趼趾跃跄距躯辄辅辆逭逮逯逵逶逸逻郾鄂鄄酗酚酝酞野铐铑铒铕铖铗铘铙铛铜铝铞铟铠铡铢铣铤铥铧铨铩铪铫铬铭铮铯铰铱铲铳铴铵银铷阈阉阊阋阌阍阎阏阐隅隆隈隋隍随隐隗雀雩雪颅领颇颈馄馅馆馗骐骑骒骓骖鸷鸸鸹鸺鸽鸾鸿鹿麸麻黄龚",
        "12" to "亵傅傈傍傣傥傧储傩傲凿剩割募博厥厦厨啻啼啾喀喁喂喃善喇喈喉喊喋喑喔喘喙喜喝喟喧喱喳喷喹喻喽喾嗖嗟堙堞堠堡堤堪堰塄塔壹奠奥婷婺婿媒媚媛媪嫂孱孳富寐寒寓尊就属屡崴崽崾嵇嵋嵌嵘嵛嵝嵫嵬嵯巯巽帽幂幄幅弑强弼彘彭御徨循悲惑惠惩惫惰惴惶惹惺愀愉愎愕愠愣愤愦愧慌慨戟戡戢扉掌掣掰掾揄揆揉揍揎描提插揖揞揠握揣揩揪揭揲援揸揽揿搀搁搂搅搓搔搜搭搽摒敞散敦敬斌斐斑斯普景晰晴晶晷智晾暂暑曾替最朝期棉棋棍棒棕棘棚棠棣森棰棱棵棹棺棼椁椅椋植椎椐椒椟椠椤椭椰楗楮榔欹欺款殖殚殛毯毳毵毽氮氯氰淼渝渡渣渤渥温渫渭港渲渴游渺湃湄湍湎湓湔湖湘湛湟湫湮湾湿溃溅溆溉溲滁滋滑滞焙焚焦焯焰焱然煮牌牍犀犄犊犋犍猢猥猩猬猱猴猸猹猾琚琛琢琥琦琨琪琬琮琰琳琴琵琶琼瑛瓿甥甯番畲畴疏痘痛痞痢痣痤痦痧痨痪痫登皓皖皴睃睇睐睑矬短硝硪硫硬确硷祺禄禅禽稀稂稃程稍税窖窗窘窜窝竣童竦筅等筋筌筏筐筑筒答策筘筚筛筝筵粞粟粢粤粥粪紫絮絷缂缃缄缅缆缇缈缉缋缌缎缏缑缒缓缔缕编缗缘缙羡翔翕翘耋耠聒联脔脾腆腈腊腋腌腑腓腔腕腙腚腱腴舄舒舜舾艇萱萼落葆葑葙葚葛葜葡董葩葫葬葭葱葳葵葶葸葺蒂蒇蒈蒉蒋蒌蒎蛐蛑蛔蛘蛙蛛蛞蛟蛤蛩蛭蛮蛰蛱蛲蛳蛴蜒蜓街裁裂装裎裒裕裙裢裣裤裥覃觌觚觞詈谟谠谡谢谣谤谥谦谧貂赋赌赍赎赏赐赓赔赕趁趄超越趋跆跋跌跎跏跑跖跗跚跛跞践辇辈辉辊辋辍辎辜逼逾遁遂遄遇遍遏遐遑遒道遗酡酢酣酤酥釉释量铸铹铺铼铽链铿销锁锂锃锄锅锆锇锈锉锊锋锌锍锎锏锐锑锒锓锔锕阑阒阔阕隔隘隙雁雄雅集雇雯雳靓韩颉颊颌颍颏飓飧飨馇馈馊馋骗骘骚骛鱿鲁鲂鹁鹂鹃鹄鹅鹆鹇鹈黍黑黹鼋鼎",
        "13" to "催傺傻像剽剿勤叠嗄嗅嗉嗌嗍嗑嗒嗓嗔嗜嗝嗡嗣嗤嗥嗦嗨嗪嗫嗬嗯嗲嗳嗵嗷嘟塌塍塑塘塞塥填塬墓媲媳媵媸媾嫁嫉嫌嫒嫔嫫寝寞尴嵊嵩嵴幌幕廉廒廓彀徭微想愁愆愈愍意愚感愫慈慊慎慑戤戥搋搌搏搐搛搞搠搡搦搪搬携摁摄摅摆摇摈摊摸敫数斟新旒暄暇暌暖暗椴椹椽椿楂楔楚楝楞楠楣楦楫楱楷楸楹楼榀概榄榆榇榈榉榘槌槎槐歃歆歇歌殿毁毂毹氲溏源溘溜溟溢溥溧溪溯溱溴溶溷溺溻溽滂滇滏滓滔滗滚滟滠满滢滤滥滦滨滩漓漠漭煅煊煌煎煜煞煤煦照煨煲煳煸煺牒犏献猷猿獒瑁瑕瑗瑙瑚瑜瑞瑟瑰甄畸畹痰痱痴痹痼痿瘀瘁瘃瘅瘐皙盟睚睛睡睢督睥睦睨睫睬睹瞄矮硼碇碉碌碍碎碑碓碗碘碚碛碜碰禀禁禊福稔稗稚稞稠稣窟窠窥窦筠筢筮筱筲筷筹筻签简粮粱粲粳缚缛缜缝缟缠缡缢缣缤罨罩罪置署群羧耢聘肄肆腠腥腧腩腭腮腰腹腺腻腼腽腾腿舅艄艉蒗蒙蒜蒡蒯蒲蒴蒸蒹蒺蒽蒿蓁蓄蓉蓊蓍蓐蓑蓓蓖蓝蓟蓠蓣蓥蓦蓬虞蛸蛹蛾蜂蜃蜇蜈蜉蜊蜍蜕蜗蜣衙裔裘裟裨裰裱裸裼裾褂褚觎觜解觥触訾詹誉誊谨谩谪谫谬豢貅貉貊赖趑趔跟跣跤跨跪跫跬路跳跷跸跹跺跻躲辏辐辑输辔辞辟遘遛遢遣遥遨鄙鄞鄢鄣酩酪酬酮酯酰酱鉴锖锗锘错锚锛锝锞锟锡锢锣锤锥锦锨锩锪锫锬锭键锯锰锱阖阗阙障雉雍雎雏零雷雹雾靖靳靴靶韪韫韵颐频颓颔颖飕馍馏馐骜骝骞骟骰骱髡魁魂鲅鲆鲇鲈鲋鲍鲎鲐鹉鹊鹋鹌鹎鹏鹑麂鼓鼠龃龄",
        "14" to "龅龆僖僚僦僧僬僭僮僳儆兢凳劁劂厮嗽嗾嘀嘁嘈嘉嘌嘎嘏嘘嘛嘞嘣嘤嘧塾墁境墅墉墒墙墚夤夥嫖嫘嫜嫠嫡嫣嫦嫩嫱孵察寡寤寥寨屣嶂幔幛廑廖弊彰愿慕慝慢慵慷截戬搴搿摔摘摞摧摭摹摺撂撄撇撖敲斡旖旗暝暧暨榍榕榛榜榧榨榫榭榱榴榷榻槁槊槔槛槟槠槭模歉殡毓滴滹漂漆漉漏演漕漤漩漪漫漯漱漳漶漾潆潇潋潍潢潴澉煽熄熊熏熔熘熙熬犒獍獐瑭瑶瑷璃甍疑瘊瘌瘕瘗瘘瘙瘟瘥瘦瘩睽睾睿瞀瞅瞍碟碡碣碥碧碱碲碳碴碹磁磋禚稳窨窬窭竭端箅箍箐箔箕算箜箝管箢箦箧箨箩箪箫箬箸粹粼粽精糁綦綮缥缦缧缨缩缪缫罂罱罴翟翠翡翥耥聚肇腐膀膂膈膊膏膑膜臧舆舔舞艋蓰蓼蓿蔌蔑蔓蔗蔚蔟蔡蔫蔷蔸蔹蔺蔻蔼蔽蕖蜀蜘蜚蜜蜞蜡蜢蜥蜩蜮蜱蜴蜷蜻蜾蜿蝇蝈蝉螂裳裴裹褊褐褓褙褛褡褪觏觫誓谭谮谯谰谱谲豪貌赘赙赚赛赫跽踅踉踊踌辕辖辗辣遭遮鄯鄱酲酴酵酶酷酸酹酽酾酿銎銮锲锴锵锶锷锸锹锺锻锼锾锿镀镁镂镄镅阚隧雌雒需霁霆静靼鞅韬韶颗馑馒骠骡骢骶骷髦魃魄魅鲑鲒鲔鲕鲚鲛鲜鲞鲟鹕鹗鹘鹚鹛鹜麽鼐鼻",
        "15" to "龇龈僵僻儇儋凛劈劐勰嘬嘭嘱嘲嘶嘹嘻嘿噌噍噎噔噗噘噙噜噢噶墀增墟墨墩嬉寮履屦嶙嶝幞幡幢廛影徵德慧慰憋憎憔憧憨憬懂戮摩撅撑撒撕撙撞撤撩撬播撮撰撵撷撸撺擒敷暮暴暹槲槽槿樊樗樘樟横樯樱橄橡橥毅滕潘潜潦潭潮潲潸潺潼澄澈澌澍澎澜澳熟熠熨熳熵牖獗獠瑾璀璁璇璋璎璜畿瘛瘠瘢瘤瘪瘫瘼瞌瞎瞑瞒瞢碾磅磉磊磐磔磕磙稷稹稻稼稽稿窳箭箱箴篁篆篇篌篑篓糅糇糈糊糌糍缬缭缮缯羯羰翦翩耦耧聩聪膘膛膝膣艏艘蔬蕃蕈蕉蕊蕙蕞蕤蕨蕲蕴蕺虢蝌蝎蝓蝗蝙蝠蝣蝤蝥蝮蝰蝴蝶蝻蝼蝽蝾螋褒褥褫褴觐觑觯谳谴谵豌豫赜赭趟趣踏踔踝踞踟踢踣踩踪踬踮踯踺躺辘遴遵醅醇醉醋醌鋈镆镇镉镊镌镍镎镏镐镑镒镓镔霄震霈霉靠靥鞋鞍鞑鞒题颚颛颜额飘餍馓馔骣骸骺骼髫髯魇鲠鲡鲢鲣鲤鲥鲦鲧鲨鲩鲫鹞鹣鹤麾黎",
        "16" to "齑龉龊儒冀凝劓嘴噤器噩噪噫噬噱噻噼嚆圜墼壁壅嬖嬗嬴寰廨廪徼憝憩憷憾懈懊懒懔撼擀擂擅操擎擐擗擞整斓暾樨樵樽樾橇橐橘橙橛橱橹橼檎檠歙殪氅氆氇潞澡澧澶澹激濂濉濑濒熹燃燎燔燕燠燧犟獬獭璞瓢甏甑瘭瘰瘳瘴瘵瘸瘾瘿癀癃盥瞟瞠瞥瞰磨磬磲磺禧穆穑窿篙篚篝篡篥篦篪篮篱篷糕糖糗糙缰缱缲缳缴罹羲翮翰翱耨耩耪聱膦膨膪膳臻蕹蕻蕾薄薅薇薏薛薜薤薨薪薮薯螃螅螈融螓螗螟螨螭螯蟆蟒衡褰褶赝赞赠踱踵踹踽蹀蹁蹂蹄蹉辙辚辨辩遽避邀邂鄹醍醐醑醒醚醛錾镖镗镘镙镛镜镝镞镟隰雕霍霎霏霓霖靛鞔鞘颞颟颠颡飙飚餐髭髹髻魈魉鲭鲮鲰鲱鲲鲳鲴鲵鲶鲷鲸鲺鲻鹦鹧鹨鹾麇麈黉黔默",
        "17" to "鼽儡嚅嚎嚏嚓壑壕嬲嬷孺嶷徽懋懑懦戴擘擢擤擦曙朦檀檄檐檑檗檩檬濞濠濡濮濯燥燮爵獯璐璨璩甓疃癌癍皤瞧瞩瞪瞬瞳瞵磴磷礁礅穗篼篾簇簋簌簏簖簧糜糟糠縻繁繇罄罅罾羁翳翼膺膻臀臁臂臃臆臊臌艚薰薷薹藁藉藏藐藓螫螬螳螵螺螽蟀蟊蟋蟑蟓蟥襁襄觳謇豁豳貔貘赡赢蹇蹈蹊蹋蹑蹒辫邃邈醢醣鍪镡镢镣镤镥镦镧镨镩镪镫隳霜霞鞠馘骤髀髁魍魏鲼鲽鳃鳄鳅鳆鳇鳊鳋鹩鹪鹫鹬麋黏黛黜黻鼢鼾龋",
        "18" to "龌龠冁嚣彝懵戳曛曜檫瀑燹璧癔癖癜癞瞻瞽瞿礓礞簟簦簪糨翻艟藕藜藤藩蟛蟠蟪蟮襟覆謦蹙蹦蹩躇邋醪鎏鏊镬镭镯镰镱雠鞣鞫鞭鞯颢餮馥髂髅鬃鬈鳌鳍鳎鳏鳐鹭鹰",
        "19" to "黝黟黠鼬嚯孽巅攀攉攒曝瀚瀛瀣爆璺瓣疆癣礤簸簿籀籁缵羸羹艨藻藿蘅蘑蘧蟹蟾蠃蠊蠓蠖襞襦警谶蹬蹭蹯蹰蹲蹴蹶蹼蹿酃醭醮醯鏖镲霪霭靡鞲鞴颤骥髋髌鬏魑鳓鳔鳕鳖鳗鳘鳙鹱麒麓",
        "20" to "礨纝麴黢黼鼗嚷嚼壤孀巍攘曦瀵瀹灌獾瓒矍籍糯纂耀蘖蘩蠕蠛譬躁躅酆醴醵镳霰颥馨骧鬓魔鳜鳝鳞",
        "21" to "鳟黥黧黩黪鼍鼯夔曩灏爝癫礴禳羼蠡蠢赣躏醺鐾露霸霹颦髓",
        "22" to "鳢麝黯鼙囊懿氍瓤穰耱蘸蘼躐躔镶",
        "23" to "霾饔饕髑鬻鹳麟攥攫癯罐趱躜颧",
        "24" to "鬟鼷鼹齄灞矗蠲蠹衢襻躞鑫",
        "25" to "鬣馕囔戆攮纛",
        "26" to "蠼爨",
        "48" to "龘"

)

//后天八卦就是周文王八卦，其成卦方法使用“四营十八变”。采用的是大衍之数，50根蓍草成卦。而先天八卦就是邵庸开始出现的。先天八卦占筮法采用的是物候之数，72根蓍草成卦。
//文王八卦成卦方法大家都非常熟悉，
/**
 * 先天占卜法
 * 本文仔细说一说先天八卦成卦法。`
 * 先天学占筮成卦步骤：
第一部分：确定四象（元会运世）
第一步：72根蓍草合在一起。（古人称：合太极）
第二步：随机分成两份即：左手一份，右手一份。（古人称：分二以象两）
第三步：左手一份不用。右手一份每次拿出4根，最终看余数。余数1为元；余数2为会；余数3为运；余数4为世。（古人称：揲4以象天四象）
第二部分：确定先天上卦
第四步：72根蓍草重新合在一起。（古人称：合太极）
地五步：随机分成两份即：左手一份，右手一份。（古人称：分二以象两）
第六步：从左手取出4根蓍草，与右手一份合在一起。（古人称：合四以象闰）
第七步：左手一份不用。右手一份每次拿出8根，最终看余数定上卦之体。余数1为乾、 2为兑、3为离、4为震、5为巽、6为坎、7为艮、8为坤。
第三部分：确定先天下卦
第八步：72根蓍草再重新合在一起。（古人称：合太极）
地九步：随机分成两份即：左手一份，右手一份。（古人称：分二以象两）
第十步：从右手取出4根蓍草，与左手一份合在一起。（古人称：合四以象闰）
第十一步：右手一份不用。右手一份每次拿出8根，最终看余数定下卦之体。余数1为乾、2为兑、3为离、4为震、5为巽、6为坎、7为艮、8为坤。
第四部分：定值事之爻
第十二步：72根蓍草第四次合在一起。（古人称：合太极）
地十三步：随机分成两份即：左手一份，右手一份。（古人称：分二以象两）
第十四步：右手一份不用。左手一份每次拿出6根，最终看余数。余数1为初爻值事；余数2为第二爻值事；余数3为第三爻值事；余数4为第四爻值事；余数5为第五爻值事；余数6为上爻值事。（古人称：揲6以象动爻）
假设：
第一部分，余数为1，则为“元”；
第二部分，余数为5，则上卦为“巽”；
第三部分，余数为7，则下卦为“艮”；
（第二、第三合起来，得到“渐卦”）
第四部分，余数为6，则说明《渐》卦的上九爻为动爻，为值事爻。
至此得到成卦结果为：元之《渐》。这个结果去卦气图中查找。《渐》卦还要对应“元之会之会之运”这个要在律吕图求之。
这里，笔者说明先天学占筮的成卦方法。据传本方法是后人所创。在邵庸著作中没有这方面内容。读者如果有兴趣探索先天学成卦法，可自己搜集宋代张文饶作品。先天学属文化沙漠，资料太少。邵庸之后研究先天学的渐渐式微，难成热点或主流。
当今，使用摇卦、抽签、蓍草占卜的人已经不多，大多人使用生日时辰、日期等取卦。传统的东西没有人继承，真的可惜。希望通天彻地就必须从弄明白这些东西开始。
 */
//余数1为乾、2为兑、3为离、4为震、5为巽、6为坎、7为艮、8为坤。
private val SYMBOL_XTBG_MAP_TABLE = hashMapOf(
        1 to "乾,111",
        0 to "坤,000",
        4 to "震,001",
        5 to "巽,110",
        6 to "坎,010",
        7 to "艮,100",
        3 to "離,101",
        2 to "兌,011"
)
//先天4相 元会运世
private val SYMBOL_SX_TABLE = hashMapOf(
        0 to "世",
        1 to "元",
        2 to "会",
        3 to "运"

)

@ExperimentalStdlibApi
fun String.getAfterGossip(): String {
//    ：72根蓍草合在一起。（古人称：合太极）
//    第二步：随机分成两份即：左手一份，右手一份。（古人称：分二以象两）
//    第三步：左手一份不用。右手一份每次拿出4根，最终看余数。余数1为元；余数2为会；余数3为运；余数4为世。（古人称：揲4以象天四象）
    //余数1为元；余数2为会；余数3为运；余数4为世。（古人称：揲4以象天四象）
    var step1 = (1..72).random() % 4
    //余数1为乾、 2为兑、3为离、4为震、5为巽、6为坎、7为艮、8为坤。
//    第二部分：确定先天上卦
//    第四步：72根蓍草重新合在一起。（古人称：合太极）
//    地五步：随机分成两份即：左手一份，右手一份。（古人称：分二以象两）
//    第六步：从左手取出4根蓍草，与右手一份合在一起。（古人称：合四以象闰）
//    第七步：左手一份不用。右手一份每次拿出8根，最终看余数定上卦之体。余数1为乾、 2为兑、3为离、4为震、5为巽、6为坎、7为艮、8为坤。
    //右手
    var step2_num1 = (1..72).random()
    //左手
    var step2_num2 = 72 - step2_num1
    var step2 = (step2_num1 + 4) % 8

    /**
     *     第八步：72根蓍草再重新合在一起。（古人称：合太极）
    地九步：随机分成两份即：左手一份，右手一份。（古人称：分二以象两）
    第十步：从右手取出4根蓍草，与左手一份合在一起。（古人称：合四以象闰）
    第十一步：右手一份不用。右手一份每次拿出8根，最终看余数定下卦之体。余数1为乾、2为兑、3为离、4为震、5为巽、6为坎、7为艮、8为坤。

     */
    //右手
    var step3_num1 = (1..72).random()
    //左手
    var step3_num2 = 72 - step3_num1
    //    余数1为乾、2为兑、3为离、4为震、5为巽、6为坎、7为艮、8为坤。
    var step3 = (step3_num2 + 4) % 8
//    第十二步：72根蓍草第四次合在一起。（古人称：合太极）
//    地十三步：随机分成两份即：左手一份，右手一份。（古人称：分二以象两）
//    第十四步：右手一份不用。左手一份每次拿出6根，最终看余数。
    //右手
    var step4_num1 = (1..72).random()
    //左手
    var step4_num2 = 72 - step4_num1
    // 余数1为初爻值事；余数2为第二爻值事；余数3为第三爻值事；余数4为第四爻值事；余数5为第五爻值事；余数6为上爻值事。（古人称：揲6以象动爻）
    var step4 = (step4_num2) % 6
    //上挂
    var sg = SYMBOL_XTBG_MAP_TABLE.get(step2)
    //下挂
    var xg = SYMBOL_XTBG_MAP_TABLE.get(step3)
    LogUtils.e("sg :$sg ,xg=$xg")
    if (sg != null && xg != null) {
        var ss = sg.split(",")
        var xx = xg.split(",")
        var sgcode = ss.get(1)
        var xgcode = xx.get(1)
        LogUtils.e("sgcode :$sgcode ,xgcode=$xgcode  step4:$step4")
        var hexagram = TEXT_GOSSIP_TO_BINARY_TABLE.get(sgcode + "" + xgcode)
        //变爻上挂
        var bySgCode = sgcode
        //变爻下挂
        var byXgCode = xgcode
        if (step4 == 0) return DECODE_MAP_JIE_TABLE.get(hexagram).toString()
        var index = 0
        if (step4 % 3 == 0) {
            index = step4 % 3 + 2
        } else {
            index = step4 % 3 - 1
        }
        if (step4 > 3) {
            var sgChars = sgcode.toCharArray()
            //计算变爻
            if (sgChars[index].equals(0)) {
                sgChars[index] = '1'
            } else {
                sgChars[index] = '0'
            }
            bySgCode = sgChars.concatToString()
        } else {
            var xgChars = xgcode.toCharArray()
//            var index=0
//            //计算变爻
//            if(step4%3==0){
//                index=step4%3+2
//            }else{
//                index=step4%3-1
//            }
            if (xgChars[index].equals(0)) {
                xgChars[index] = '1'
            } else {
                xgChars[index] = '0'
            }

            byXgCode = xgChars.concatToString()
        }
        LogUtils.e("bySgCode :$bySgCode ,byXgCode=$byXgCode")
        var byHexagram = TEXT_GOSSIP_TO_BINARY_TABLE.get(bySgCode + "" + byXgCode)
        LogUtils.e("byHexagram :$byHexagram ")
        return SYMBOL_SX_TABLE.get(step1) + " 之  $hexagram \n" + DECODE_MAP_JIE_TABLE.get(hexagram).toString() + "\n" + DECODE_MAP_JIE_TABLE.get(byHexagram).toString()

    }

    return SYMBOL_SX_TABLE.get(step1) + sg + xg + step4
    //偶为阴，奇为阳

    //111 乾 ，000坤 ,110 巽  010 坎，011兌 ，001震，101 离，100 艮

}

fun String.getAssetsJson(context: Context): String {
    val pattern =  Regex(pattern =  "^[\u4e00-\u9fa5]")
    //原文出自【易百教程】，商业转载请联系作者获得授权，非商业请保留原文链接：https://www.yiibai.com/kotlin/kotlin-regular-expressions-introduction.html

LogUtils.e("pattern.containsMatchIn(this) :${pattern.containsMatchIn(this)}" )


//    if(!pattern.containsMatchIn(this)) return "0"
    var result =getJson(context,"storkes.json")


    try {

        LogUtils.e(   result.toString())
        var storkes = mutableListOf<Storke>()
        storkes = Gson().fromJson<MutableList<Storke>>(
                result.toString(),
                object : TypeToken<MutableList<Storke>>() {}.type)
        for (mutableEntry in storkes) {
            if(mutableEntry.content.contains(this)){
                return mutableEntry.strokes
            }
        }
//        result = EncodingUtils.getString(buffer, ENCODING)
    } catch (e: Exception) {
        e.printStackTrace()
    }
    return "0"
}


fun getJson(context: Context, fileName: String?): String? {
    val stringBuilder = java.lang.StringBuilder()
    //获得assets资源管理器
    val assetManager = context.assets
    //使用IO流读取json文件内容
    try {
        val bufferedReader = BufferedReader(InputStreamReader(
                assetManager.open(fileName!!), "utf-8"))
        var line: String?
        while (bufferedReader.readLine().also { line = it } != null) {
            stringBuilder.append(line)
        }
        bufferedReader.close()
    } catch (e: IOException) {
        e.printStackTrace()
    }
    return stringBuilder.toString()
}